Revit 2024 API
DocumentEntryPoint Properties
The DocumentEntryPoint type exposes the following members.
Properties
Name | Description
ActiveProjectLocation
Retrieve the active project location.
 (Inherited from Document.)
ActiveView
The document's active view.
 (Inherited from Document.)
AddinFolder
 The full path to the Revit Macros module.
Application
Returns the Application in which the Document resides.
 (Inherited from Document.)
Create
An object that can be used to create new instances of Autodesk Revit API elements within a project.
 (Inherited from Document.)
CreationGUID
 A unique identifier generated when the Document was first created.
 (Inherited from Document.)
DisplayUnitSystem
Provides access to display unit type with in the document.
 (Inherited from Document.)
FamilyCreate
An object that can be used to create new instances of Autodesk Revit API elements within a family document.
 (Inherited from Document.)
FamilyManager
The family manager object provides access to family types and parameters.
 (Inherited from Document.)
IsDetached
 Identifies if a workshared document is detached. Also, see IsWorkshared
 (Inherited from Document.)
IsFamilyDocument
Identifies if the current document is a family document.
 (Inherited from Document.)
IsLinked
 Identifies if a document is a linked RVT.
 (Inherited from Document.)
IsModelInCloud
 Identifies if document is stored on Autodesk cloud services.
 (Inherited from Document.)
IsModifiable
 Identifies if the document is modifiable.
 (Inherited from Document.)
IsModified
 The state of changes made to the document.
 (Inherited from Document.)
IsReadOnly
 Identifies if the document is read-only or can possibly be modified.
 (Inherited from Document.)
IsReadOnlyFile
 Signals whether the document was opened from a read-only file.
 (Inherited from Document.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Document.)
IsWorkshared
 Identifies if worksharing (i.e. editing permissions and multiple worksets) have been enabled in the document. Also, see IsDetached
 (Inherited from Document.)
MassDisplayTemporaryOverride
 This setting controls temporary display in views of objects with mass category or subcategories.
 (Inherited from Document.)
MullionTypes
This property is used to retrieve all the mullion types in current system.
 (Inherited from Document.)
OwnerFamily
Get the Family of this Family Document.
 (Inherited from Document.)
PanelTypes
Retrieves a set of PanelType objects that contains all the panel types that are currently loaded into the project.
 (Inherited from Document.)
ParameterBindings
Retrieves an object from which mappings between parameter definitions and categories can be found.
 (Inherited from Document.)
PathName
 The fully qualified path of the document's disk file.
 (Inherited from Document.)
Phases
Retrieves all of the phases in the document.
 (Inherited from Document.)
PlanTopologies
Get the PlanTopologies of the current project in the last phase.
 (Inherited from Document.)
PlanTopologies[Phase]
Gets the PlanTopologies of the current project in a given phase.
 (Inherited from Document.)
PlanTopology[Level]
Get the PlanTopology of a given level in the last phase.
 (Inherited from Document.)
PlanTopology[Level, Phase]
Get the PlanTopology of a given level in a given phase.
 (Inherited from Document.)
PrintManager
 Retrieve the PrintManager of current project.
 (Inherited from Document.)
ProjectInformation
Return the Project Information of the current project.
 (Inherited from Document.)
ProjectLocations
Retrieve all the project locations associated with this project
 (Inherited from Document.)
ReactionsAreUpToDate
Reports if the analytical model has regenerated in a document with reaction loads.
 (Inherited from Document.)
Settings
Provides access to general application settings, such as Categories.
 (Inherited from Document.)
SiteLocation
Returns the site location information.
 (Inherited from Document.)
Title
 The document's title.
 (Inherited from Document.)
TypeOfStorage
Get the storage type of the specified BuiltInParameter.
 (Inherited from Document.)
WorksharingCentralGUID
 The central GUID of the server-based model.
 (Inherited from Document.)
See Also
DocumentEntryPoint Class
Autodesk.Revit.DB.Macros Namespace